SerhiiLe/clock-esp8266-ws2812b/src/web.cpp
	set_simple_string(F("str_hello"), str_hello);
	set_simple_int(F("max_alarm_time"), max_alarm_time, 1, 30);
	set_simple_int(F("run_allow"), run_allow, 0, 2);
	set_simple_time(F("run_begin"), run_begin);
	set_simple_time(F("run_end"), run_end);
	set_simple_checkbox(F("wide_font"), wide_font);
	set_simple_checkbox(F("show_move"), show_move);
	set_simple_int(F("delay_move"), delay_move, 0, 10);
	set_simple_int(F("max_move"), max_move, delay_move, 255);
	bool sync_time = false;
	if( set_simple_int(F("tz_shift"), tz_shift, -12, 12) )
		sync_time = true;
	if( set_simple_checkbox(F("tz_dst"), tz_dst) )
		sync_time = true;
	set_simple_checkbox(F("date_short"), show_date_short);
	if( set_simple_int(F("date_period"), show_date_period, 20, 1439) )
		clockDate.setInterval(1000U * show_date_period);
	set_simple_int(F("time_color"), show_time_color, 0, 3);
	set_simple_color(F("time_color0"), show_time_color0);
	set_simple_color(F("time_color1"), show_time_col[0]);
	set_simple_color(F("time_color2"), show_time_col[1]);
	set_simple_color(F("time_color3"), show_time_col[2]);
	set_simple_color(F("time_color4"), show_time_col[3]);
	set_simple_color(F("time_color5"), show_time_col[4]);
	set_simple_int(F("date_color"), show_date_color, 0, 2);
	set_simple_color(F("date_color0"), show_date_color0);
	bool need_bright = false;
	if( set_simple_int(F("bright_mode"), bright_mode, 0, 2) )
		need_bright = true;
	if( set_simple_int(F("bright0"), bright0, 1, 255) )
		need_bright = true;
	set_simple_int(F("br_boost"), bright_boost, 1, 1000);
	if( set_simple_int(F("boost_mode"), boost_mode, 0, 5) )
		sync_time = true;
	if( set_simple_int(F("br_add"), bright_add, 1, 255) )
		need_bright = true;
	if( set_simple_float(F("latitude"), latitude, -180.0f, 180.0f) )
		sync_time = true;
	if( set_simple_float(F("longitude"), longitude, -180.0f, 180.0f) )
		sync_time = true;
	set_simple_time(F("br_begin"), bright_begin);
	set_simple_time(F("br_end"), bright_end);
	if( set_simple_int(F("max_power"), max_power, 200, MAX_POWER) )
		if(DEFAULT_POWER > 0) FastLED.setMaxPowerInVoltsAndMilliamps(5, max_power);
	set_simple_int(F("turn_display"), turn_display, 0, 3);
	set_simple_int(F("volume_start"), volume_start, 1, 30);
	set_simple_int(F("volume_finish"), volume_finish, 1, 30);
	volume_finish = constrain(volume_finish, volume_start, 30);
	if( set_simple_int(F("volume_period"), volume_period, 1, 30) )
		alarmStepTimer.setInterval(1000U * volume_period);
	if( set_simple_int(F("timeout_mp3"), timeout_mp3, 1, 255) )
		timeoutMp3Timer.setInterval(3600000U * timeout_mp3);
	if( set_simple_int(F("sync_time_period"), sync_time_period, 1, 255) )
		ntpSyncTimer.setInterval(3600000U * sync_time_period);
	if( set_simple_int(F("scroll_period"), scroll_period, 20, 1440) )
		scrollTimer.setInterval(scroll_period);
	bool need_web_restart = false;
	if( set_simple_string(F("web_login"), web_login) )
		need_web_restart = true;
	if( set_simple_string(F("web_password"), web_password) )
		need_web_restart = true;

	HTTP.sendHeader(F("Location"),"/");
	HTTP.send(303);
	delay(1);
	if( need_save ) save_config_main();
	initRString(PSTR("Настройки сохранены"));
	if( sync_time ) syncTime();
	if( need_bright ) old_bright_boost = !old_bright_boost;
	if(need_web_restart) httpUpdater.setup(&HTTP, web_login, web_password);
}

// сохранение настроек telegram (охраны)
void save_telegram() {
	if(is_no_auth()) return;
	need_save = false;
	bool fl_setTelegram = false;

	set_simple_checkbox(F("use_move"), use_move);
	set_simple_checkbox(F("use_brightness"), use_brightness);
	set_simple_string(F("pin_code"), pin_code);
	if( set_simple_string(F("clock_name"), clock_name) )
		if(fl_mdns)	MDNS.setHostname(clock_name.c_str());
	set_simple_int(F("sensor_timeout"), sensor_timeout, 1, 16000);
	set_simple_string(F("tb_name"), tb_name);
	if( set_simple_string(F("tb_chats"), tb_chats) )
		fl_setTelegram = true;
	if( set_simple_string(F("tb_token"), tb_token) )
		fl_setTelegram = true;
	set_simple_string(F("tb_secret"), tb_secret);
	if( set_simple_int(F("tb_rate"), tb_rate, 0, 3600) )
		telegramTimer.setInterval(1000U * tb_rate);
	set_simple_int(F("tb_accelerated"), tb_accelerated, 1, 600);
	set_simple_int(F("tb_accelerate"), tb_accelerate, 1, 3600);
	set_simple_int(F("tb_ban"), tb_ban, 900, 3600);

	HTTP.sendHeader(F("Location"),"/security.html");
	HTTP.send(303);
	delay(1);
	if( need_save ) save_config_telegram();
	initRString(PSTR("Настройки сохранены"));
	if(fl_setTelegram) setup_telegram();
}

// перезагрузка часов, сброс ком-порта, отключение сети и диска, чтобы ничего не мешало перезагрузке
void reboot_clock() {
	Serial.flush();
	WiFi.forceSleepBegin(); //disable AP & station by calling "WiFi.mode(WIFI_OFF)" & put modem to sleep
	LittleFS.end();
	delay(1000);
	ESP.restart();
}

void maintence() {
	if(is_no_auth()) return;
	HTTP.sendHeader(F("Location"),"/");
	HTTP.send(303); 
	initRString(PSTR("Сброс"));
	if( HTTP.hasArg("t") ) {
		if( HTTP.arg("t") == "t" && LittleFS.exists(F("/texts.json")) ) {
			LOG(println, PSTR("reset texts"));
			LittleFS.remove(F("/texts.json"));
			reboot_clock();
		}
		if( HTTP.arg("t") == "a" && LittleFS.exists(F("/alarms.json")) ) {
			LOG(println, PSTR("reset alarms"));
			LittleFS.remove(F("/alarms.json"));
			reboot_clock();
		}
		if( HTTP.arg("t") == "c" && LittleFS.exists(F("/config.json")) ) {
			LOG(println, PSTR("reset settings"));
			LittleFS.remove(F("/config.json"));
			reboot_clock();
		}
		if( HTTP.arg("t") == "l" ) {
			LOG(println, PSTR("erase logs"));
			char fileName[32];
			for(int8_t i=0; i<SEC_LOG_COUNT; i++) {
				sprintf_P(fileName, SEC_LOG_FILE, i);
				if( LittleFS.exists(fileName) ) LittleFS.remove(fileName);
			}
			reboot_clock();
		}
		if( HTTP.arg("t") == "r" ) {
			reboot_clock();
		}
	}
}

// сохранение настроек будильника
void save_alarm() {
	if(is_no_auth()) return;
	need_save = false;
	uint8_t target = 0;
	uint16_t settings = 512;
	String name = F("target");
	if( HTTP.hasArg(name) ) {
		target = HTTP.arg(name).toInt();
		name = F("time");
		if( HTTP.hasArg(name) ) {
			// выделение часов и минут из строки вида 00:00
			size_t pos = HTTP.arg(name).indexOf(":");
			uint8_t h = constrain(HTTP.arg(name).toInt(), 0, 23);
			uint8_t m = constrain(HTTP.arg(name).substring(pos+1).toInt(), 0, 59);
			if( h != alarms[target].hour || m != alarms[target].minute ) {
				alarms[target].hour = h;
				alarms[target].minute = m;
				need_save = true;
			}
		}
		name = F("rmode");
		if( HTTP.hasArg(name) ) settings |= constrain(HTTP.arg(name).toInt(), 0, 3) << 7;
		if( HTTP.hasArg(F("mo")) ) settings |= 2;
		if( HTTP.hasArg(F("tu")) ) settings |= 4;
		if( HTTP.hasArg(F("we")) ) settings |= 8;
		if( HTTP.hasArg(F("th")) ) settings |= 16;
		if( HTTP.hasArg(F("fr")) ) settings |= 32;
		if( HTTP.hasArg(F("sa")) ) settings |= 64;
		if( HTTP.hasArg(F("su")) ) settings |= 1;
		if( settings != alarms[target].settings ) {
			alarms[target].settings = settings;
			need_save = true;
		}
		set_simple_int(F("melody"), alarms[target].melody, 1, mp3_all);
		set_simple_int(F("txt"), alarms[target].text, -1, MAX_RUNNING-1);
	}
	HTTP.sendHeader(F("Location"),F("/alarms.html"));
	HTTP.send(303);
	delay(1);
	if( need_save ) save_config_alarms();
	mp3_stop();
	initRString(PSTR("Будильник установлен"));
}

