SerhiiLe/clock-esp8266-ws2812b/src/web.cpp
// отключение будильника
void off_alarm() {
	if(is_no_auth()) return;
	uint8_t target = 0;
	String name = "t";
	if( HTTP.hasArg(name) ) {
		target = HTTP.arg(name).toInt();
		if( alarms[target].settings & 512 ) {
			alarms[target].settings &= ~(512U);
			save_config_alarms();
			text_send(F("1"));
			initRString(PSTR("Будильник отключён"));
		}
	} else
		text_send(F("0"));
}

// сохранение настроек бегущей строки. Строки настраиваются по одной.
void save_text() {
	if(is_no_auth()) return;
	need_save = false;
	uint8_t target = 0;
	uint16_t settings = 512;
	String name = F("target");
	if( HTTP.hasArg(name) ) {
		target = HTTP.arg(name).toInt();
		set_simple_string(F("text"), texts[target].text);
		if( set_simple_int(F("period"), texts[target].period, 30, 3600) )
			textTimer[target].setInterval(texts[target].period*1000U);
		set_simple_int(F("color_mode"), texts[target].color_mode, 0, 3);
		set_simple_color(F("color"), texts[target].color);
		name = F("rmode");
		if( HTTP.hasArg(name) ) settings |= constrain(HTTP.arg(name).toInt(), 0, 3) << 7;
		if( HTTP.hasArg("mo") ) settings |= 2;
		if( HTTP.hasArg("tu") ) settings |= 4;
		if( HTTP.hasArg("we") ) settings |= 8;
		if( HTTP.hasArg("th") ) settings |= 16;
		if( HTTP.hasArg("fr") ) settings |= 32;
		if( HTTP.hasArg("sa") ) settings |= 64;
		if( HTTP.hasArg("su") ) settings |= 1;
		if((settings >> 7 & 3) == 3) { // если режим "до конца дня", то записать текущий день
			tm t = getTime();
			settings |= t.tm_mday << 10;
		} else { // иначе то, что передано формой
			name = "sel_day";
			if( HTTP.hasArg(name) ) settings |= constrain(HTTP.arg(name).toInt(), 1, 31) << 10;
		}
		if( settings != texts[target].repeat_mode ) {
			texts[target].repeat_mode = settings;
			need_save = true;
		}
	}
	HTTP.sendHeader(F("Location"),F("/running.html"));
	HTTP.send(303);
	delay(1);
	if( need_save ) save_config_texts();
	initRString(PSTR("Текст установлен"));
}

// отключение бегущей строки
void off_text() {
	if(is_no_auth()) return;
	uint8_t target = 0;
	String name = "t";
	if( HTTP.hasArg(name) ) {
		target = HTTP.arg(name).toInt();
		if( texts[target].repeat_mode & 512 ) {
			texts[target].repeat_mode &= ~(512U);
			save_config_texts();
			text_send(F("1"));
			initRString(PSTR("Текст отключён"));
		}
	} else
		text_send(F("0"));
}

// костыль для настройки режима повтора. Работает 50/50
void repeat_mode(uint8_t r) {
	static uint8_t old_r = 0;
	if(r==0) {
		if(old_r==1) mp3_disableLoop();
		if(old_r==2) mp3_disableLoopAll();
		// mp3_stop();
	}
	if(r==1) {
		if(old_r==2) mp3_disableLoopAll();
		mp3_enableLoop();
	}
	if(r==2) {
		if(old_r==1) mp3_disableLoop();
		mp3_enableLoopAll();
	}
	if(r==3) mp3_randomAll();
	old_r = r;
}

// обслуживает страничку плейера.
void play() {
	if(is_no_auth()) return;
	uint8_t p = 0;
	uint8_t r = 0;
	uint8_t v = 15;
	uint16_t c = 1;
	int t = 0;
	String name = "p";
	if( HTTP.hasArg(name) ) p = HTTP.arg(name).toInt();
	name = "c";
	if( HTTP.hasArg(name) ) c = constrain(HTTP.arg(name).toInt(), 1, mp3_all);
	name = "r";
	if( HTTP.hasArg(name) ) r = constrain(HTTP.arg(name).toInt(), 0, 3);
	name = "v";
	if( HTTP.hasArg(name) ) v = constrain(HTTP.arg(name).toInt(), 1, 30);
	switch (p)	{
		case 1: // предыдущий трек
			t = mp3_current - 1;
			if(t<1) t=mp3_all;
			mp3_play(t);
			break;
		case 2: // следующий трек
			t = mp3_current + 1;
			if(t>mp3_all) t=1;
			mp3_play(t);
			break;
		case 3: // играть
			repeat_mode(r);
			delay(10);
			mp3_play(c);
			break;
		case 4: // пауза
			mp3_pause();
			break;
		case 5: // режим
			repeat_mode(r);
			break;
		case 6: // остановить
			mp3_stop();
			break;
		case 7: // тише
			t = cur_Volume - 1;
			if(t<0) t=0;
			mp3_volume(t);
			break;
		case 8: // громче
			t = cur_Volume + 1;
			if(t>30) t=30;
			mp3_volume(t);
			break;
		case 9: // громкость
			mp3_volume(v);
			break;
		default:
			// if(!mp3_isInit) mp3_init();
			// else mp3_reread();
			// if(mp3_isInit) mp3_update();
			mp3_reread();
			mp3_update();
			break;
	}
	char buff[20];
	sprintf_P(buff,PSTR("%i:%i:%i:%i"),mp3_current,mp3_all,cur_Volume,mp3_isPlay());
	text_send(buff);
}

// "proxy" отправка сообщений в телеграм через web запрос, для сторонних устройств
void send() {
	// if(is_no_auth()) return;
	String name = F("pin");
	if( HTTP.hasArg(name) ) {
		if( pin_code == HTTP.arg(name) ) {
			name = F("msg");
			if( HTTP.hasArg(name) ) {
				tb_send_msg(HTTP.arg(name));
				text_send(F("1"));
				return;
			}
		}
	}
	text_send(F("0"));
}

// Установка времени. Для крайних случаев, когда интернет отсутствует
void set_clock() {
	if(is_no_auth()) return;
	uint8_t type=0;
	String name = "t";
	if(HTTP.hasArg(name)) {
		struct tm tm;
		type = HTTP.arg(name).toInt();
		if(type==0 || type==1) {
			name = F("time");
			if(HTTP.hasArg(name)) {
				size_t pos = HTTP.arg(name).indexOf(":");
				tm.tm_hour = constrain(HTTP.arg(name).toInt(), 0, 23);
				tm.tm_min = constrain(HTTP.arg(name).substring(pos+1).toInt(), 0, 59);
				name = F("date");
				if(HTTP.hasArg(name)) {
					size_t pos = HTTP.arg(name).indexOf("-");
					tm.tm_year = constrain(HTTP.arg(name).toInt()-1900, 0, 65000);
					tm.tm_mon = constrain(HTTP.arg(name).substring(pos+1).toInt()-1, 0, 11);
					size_t pos2 = HTTP.arg(name).substring(pos+1).indexOf("-");
					tm.tm_mday = constrain(HTTP.arg(name).substring(pos+pos2+2).toInt(), 1, 31);
					name = F("sec");
					if(HTTP.hasArg(name)) {
						tm.tm_sec = constrain(HTTP.arg(name).toInt()+1, 0, 60);
						tm.tm_isdst = tz_dst;
						time_t t = mktime(&tm);
						LOG(printf_P,"web time: %llu\n",t);
						// set the system time
						timeval tv = { t, 0 };
						settimeofday(&tv, nullptr);
					}
				}
			}
		} else {
			syncTime();
		}
		HTTP.sendHeader(F("Location"),F("/maintenance.html"));
		HTTP.send(303);
		delay(1);
	} else {
		tm t = getTime();
		HTTP.client().print(PSTR("HTTP/1.1 200\r\nContent-Type: application/json\r\nConnection: close\r\n\r\n{"));
		HTTP.client().printf_P(PSTR("\"time\":\"%u\","), t.tm_hour*60+t.tm_min);
		HTTP.client().printf_P(PSTR("\"date\":\"%u-%02u-%02u\"}"), t.tm_year +1900, t.tm_mon +1, t.tm_mday);
		HTTP.client().stop();
	}
}

// Включение/выключение различных режимов
void onoff() {
	if(is_no_auth()) return;
	int8_t a=0;
	bool cond=false;
	String name = "a";
	if(HTTP.hasArg(name)) a = HTTP.arg(name).toInt();
	name = "t";
	if(HTTP.hasArg(name)) {
		if(HTTP.arg(name) == F("demo")) {
			// включает/выключает демо режим
			if(a) fl_demo = !fl_demo;
			cond = fl_demo;
		} else 
		if(HTTP.arg(name) == F("ftp")) {
			// включает/выключает ftp сервер, чтобы не кушал ресурсов просто так
			if(a) ftp_isAllow = !ftp_isAllow;
			cond = ftp_isAllow;
		} else
		if(HTTP.arg(name) == F("security")) {
			// включает/выключает режим "охраны"
			if(a) sec_enable = !(bool)sec_enable;
			cond = sec_enable;
			save_log_file(cond?SEC_TEXT_ENABLE:SEC_TEXT_DISABLE);
			save_config_security();
		}
	}
	text_send(cond?F("1"):F("0"));
}

// Информация о состоянии железки
void sysinfo() {
	if(is_no_auth()) return;
	char buf[100];
	HTTP.client().print(PSTR("HTTP/1.1 200\r\nContent-Type: application/json\r\nConnection: close\r\n\r\n{"));
	HTTP.client().printf_P(PSTR("\"Uptime\":\"%s\","), getUptime(buf));
	HTTP.client().printf_P(PSTR("\"Time\":\"%s\","), clockCurrentText(buf));
	HTTP.client().printf_P(PSTR("\"Date\":\"%s\","), dateCurrentTextLong(buf));
	HTTP.client().printf_P(PSTR("\"Sunrise\":\"%u:%02u\","), sunrise / 60, sunrise % 60);
	HTTP.client().printf_P(PSTR("\"Sunset\":\"%u:%02u\","), sunset / 60, sunset % 60);
	HTTP.client().printf_P(PSTR("\"Illumination\":%i,"), analogRead(PIN_PHOTO_SENSOR));
	HTTP.client().printf_P(PSTR("\"LedBrightness\":%i,"), led_brightness);
	HTTP.client().printf_P(PSTR("\"fl_5v\":%i,"), fl_5v);
	HTTP.client().printf_P(PSTR("\"Rssi\":%i,"), wifi_rssi());
	HTTP.client().printf_P(PSTR("\"FreeHeap\":%i,"), ESP.getFreeHeap());
	HTTP.client().printf_P(PSTR("\"MaxFreeBlockSize\":%i,"), ESP.getMaxFreeBlockSize());
	HTTP.client().printf_P(PSTR("\"HeapFragmentation\":%i,"), ESP.getHeapFragmentation());
	HTTP.client().printf_P(PSTR("\"CpuFreqMHz\":%i,"), ESP.getCpuFreqMHz());
	HTTP.client().printf_P(PSTR("\"ResetReason\":\"%s\","), ESP.getResetReason().c_str());
	HTTP.client().printf_P(PSTR("\"FullVersion\":\"%s\"}"), ESP.getFullVersion().c_str());
	HTTP.client().stop();
}

cur_sensor sensor[MAX_SENSORS];

// Информация о зарегистрированных сенсорах
void sensors() {
	if(is_no_auth()) return;
	bool fl = false;
	HTTP.client().print(PSTR("HTTP/1.1 200\r\nContent-Type: application/json\r\nConnection: close\r\n\r\n["));
	for(uint8_t i=0; i<MAX_SENSORS; i++) {
		if(sensor[i].registered >= getTimeU() - sensor_timeout*60 + 60) {
			if(fl) HTTP.client().print(",");
			HTTP.client().printf_P(PSTR("{\"num\":%i,"), i);
			HTTP.client().printf_P(PSTR("\"hostname\":\"%s\","), sensor[i].hostname.c_str());
			HTTP.client().printf_P(PSTR("\"ip\":\"%s\","), sensor[i].ip.toString().c_str());
			HTTP.client().printf_P(PSTR("\"timeout\":%i}"), getTimeU() - sensor[i].registered);
			fl = true;
		}
	}
	HTTP.client().print("]");
	HTTP.client().stop();
}

// Регистрация сенсора
void registration() {
	// Авторизация примитивная, через shared key, или pin
	// должно быть всего два параметра: pin (shared key) и name - имя устройства
	String name = F("pin");
	if( HTTP.hasArg(name) ) {
		if( pin_code == HTTP.arg(name) ) {
			// pin подошел
			name = F("name");
			if( HTTP.hasArg(name) ) {
				IPAddress sensor_ip = HTTP.client().remoteIP();
				bool fl_found = false;
				// проверка, зарегистрирован ли уже этот ip
				for(uint8_t i=0; i<MAX_SENSORS; i++) {
					if(sensor[i].ip == sensor_ip) {
						// надо ли обновить hostname
						if(sensor[i].hostname != HTTP.arg(name))
							sensor[i].hostname = HTTP.arg(name);
						// обновить время регистрации
						sensor[i].registered = getTimeU();
						fl_found = true;
						break;
					}
				}
				if(!fl_found) {
					// новый сенсор, поиск свободной ячейки
					for(uint8_t i=0; i<MAX_SENSORS; i++) {
						if(sensor[i].registered < getTimeU() - sensor_timeout*60 - 60) {
							// найдена свободная ячейка
							sensor[i].hostname = HTTP.arg(name);
							sensor[i].ip = sensor_ip;
							sensor[i].registered = getTimeU();
							fl_found = true;
							break;
						}
					}
				}
				if(fl_found) {
					LOG(printf_P,PSTR("registered \"%s\" ip %s\n"), HTTP.arg(name).c_str(), sensor_ip.toString().c_str());
					text_send(F("1"));
					return;
				}
			}
		}
	}
	// любая ошибка, в том числе закончились свободные ячейки
	text_send(F("0"));
}